Revit 2024 API
FillGrid.GetHatchingDirection Method
 Provides the hatching propagation. Hatching is inverted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public UV GetHatchingDirection()
Visual Basic
Public Function GetHatchingDirection As UV
Visual C++
public:
UV^ GetHatchingDirection()
Return Value
 The direction of hatching.
See Also
FillGrid Class
Autodesk.Revit.DB Namespace